{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "[UNK]",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "vocab": {
      "[UNK]": 0,
      "[CLS]": 1,
      "[SEP]": 2,
      "[PAD]": 3,
      "[MASK]": 4,
      "!": 5,
      "#": 6,
      "*": 7,
      ",": 8,
      "-": 9,
      ".": 10,
      "=": 11,
      "?": 12,
      "N": 13,
      "Q": 14,
      "^": 15,
      "_": 16,
      "`": 17,
      "a": 18,
      "b": 19,
      "d": 20,
      "e": 21,
      "f": 22,
      "g": 23,
      "h": 24,
      "i": 25,
      "j": 26,
      "k": 27,
      "l": 28,
      "m": 29,
      "n": 30,
      "o": 31,
      "p": 32,
      "s": 33,
      "t": 34,
      "u": 35,
      "v": 36,
      "w": 37,
      "x": 38,
      "y": 39,
      "z": 40,
      "~": 41,
      "æ": 42,
      "ç": 43,
      "ð": 44,
      "ŋ": 45,
      "ɑ": 46,
      "ɔ": 47,
      "ə": 48,
      "ɛ": 49,
      "ɥ": 50,
      "ɪ": 51,
      "ɫ": 52,
      "ɯ": 53,
      "ɸ": 54,
      "ɹ": 55,
      "ɾ": 56,
      "ʃ": 57,
      "ʊ": 58,
      "ʑ": 59,
      "ʒ": 60,
      "ʰ": 61,
      "ˈ": 62,
      "ˌ": 63,
      "θ": 64,
      "…": 65,
      "⁼": 66,
      "→": 67,
      "↑": 68,
      "↓↑": 69,
      "↓": 70,
      "!→": 71,
      "!↑": 72,
      "!↓↑": 73,
      "!↓": 74,
      "#→": 75,
      "#↑": 76,
      "#↓↑": 77,
      "#↓": 78,
      "*→": 79,
      "*↑": 80,
      "*↓↑": 81,
      "*↓": 82,
      ",→": 83,
      ",↑": 84,
      ",↓↑": 85,
      ",↓": 86,
      "-→": 87,
      "-↑": 88,
      "-↓↑": 89,
      "-↓": 90,
      ".→": 91,
      ".↑": 92,
      ".↓↑": 93,
      ".↓": 94,
      "=→": 95,
      "=↑": 96,
      "=↓↑": 97,
      "=↓": 98,
      "?→": 99,
      "?↑": 100,
      "?↓↑": 101,
      "?↓": 102,
      "N→": 103,
      "N↑": 104,
      "N↓↑": 105,
      "N↓": 106,
      "Q→": 107,
      "Q↑": 108,
      "Q↓↑": 109,
      "Q↓": 110,
      "^→": 111,
      "^↑": 112,
      "^↓↑": 113,
      "^↓": 114,
      "_→": 115,
      "_↑": 116,
      "_↓↑": 117,
      "_↓": 118,
      "`→": 119,
      "`↑": 120,
      "`↓↑": 121,
      "`↓": 122,
      "a→": 123,
      "a↑": 124,
      "a↓↑": 125,
      "a↓": 126,
      "b→": 127,
      "b↑": 128,
      "b↓↑": 129,
      "b↓": 130,
      "d→": 131,
      "d↑": 132,
      "d↓↑": 133,
      "d↓": 134,
      "e→": 135,
      "e↑": 136,
      "e↓↑": 137,
      "e↓": 138,
      "f→": 139,
      "f↑": 140,
      "f↓↑": 141,
      "f↓": 142,
      "g→": 143,
      "g↑": 144,
      "g↓↑": 145,
      "g↓": 146,
      "h→": 147,
      "h↑": 148,
      "h↓↑": 149,
      "h↓": 150,
      "i→": 151,
      "i↑": 152,
      "i↓↑": 153,
      "i↓": 154,
      "j→": 155,
      "j↑": 156,
      "j↓↑": 157,
      "j↓": 158,
      "k→": 159,
      "k↑": 160,
      "k↓↑": 161,
      "k↓": 162,
      "l→": 163,
      "l↑": 164,
      "l↓↑": 165,
      "l↓": 166,
      "m→": 167,
      "m↑": 168,
      "m↓↑": 169,
      "m↓": 170,
      "n→": 171,
      "n↑": 172,
      "n↓↑": 173,
      "n↓": 174,
      "o→": 175,
      "o↑": 176,
      "o↓↑": 177,
      "o↓": 178,
      "p→": 179,
      "p↑": 180,
      "p↓↑": 181,
      "p↓": 182,
      "s→": 183,
      "s↑": 184,
      "s↓↑": 185,
      "s↓": 186,
      "t→": 187,
      "t↑": 188,
      "t↓↑": 189,
      "t↓": 190,
      "u→": 191,
      "u↑": 192,
      "u↓↑": 193,
      "u↓": 194,
      "v→": 195,
      "v↑": 196,
      "v↓↑": 197,
      "v↓": 198,
      "w→": 199,
      "w↑": 200,
      "w↓↑": 201,
      "w↓": 202,
      "x→": 203,
      "x↑": 204,
      "x↓↑": 205,
      "x↓": 206,
      "y→": 207,
      "y↑": 208,
      "y↓↑": 209,
      "y↓": 210,
      "z→": 211,
      "z↑": 212,
      "z↓↑": 213,
      "z↓": 214,
      "~→": 215,
      "~↑": 216,
      "~↓↑": 217,
      "~↓": 218,
      "æ→": 219,
      "æ↑": 220,
      "æ↓↑": 221,
      "æ↓": 222,
      "ç→": 223,
      "ç↑": 224,
      "ç↓↑": 225,
      "ç↓": 226,
      "ð→": 227,
      "ð↑": 228,
      "ð↓↑": 229,
      "ð↓": 230,
      "ŋ→": 231,
      "ŋ↑": 232,
      "ŋ↓↑": 233,
      "ŋ↓": 234,
      "ɑ→": 235,
      "ɑ↑": 236,
      "ɑ↓↑": 237,
      "ɑ↓": 238,
      "ɔ→": 239,
      "ɔ↑": 240,
      "ɔ↓↑": 241,
      "ɔ↓": 242,
      "ə→": 243,
      "ə↑": 244,
      "ə↓↑": 245,
      "ə↓": 246,
      "ɛ→": 247,
      "ɛ↑": 248,
      "ɛ↓↑": 249,
      "ɛ↓": 250,
      "ɥ→": 251,
      "ɥ↑": 252,
      "ɥ↓↑": 253,
      "ɥ↓": 254,
      "ɪ→": 255,
      "ɪ↑": 256,
      "ɪ↓↑": 257,
      "ɪ↓": 258,
      "ɫ→": 259,
      "ɫ↑": 260,
      "ɫ↓↑": 261,
      "ɫ↓": 262,
      "ɯ→": 263,
      "ɯ↑": 264,
      "ɯ↓↑": 265,
      "ɯ↓": 266,
      "ɸ→": 267,
      "ɸ↑": 268,
      "ɸ↓↑": 269,
      "ɸ↓": 270,
      "ɹ→": 271,
      "ɹ↑": 272,
      "ɹ↓↑": 273,
      "ɹ↓": 274,
      "ɾ→": 275,
      "ɾ↑": 276,
      "ɾ↓↑": 277,
      "ɾ↓": 278,
      "ʃ→": 279,
      "ʃ↑": 280,
      "ʃ↓↑": 281,
      "ʃ↓": 282,
      "ʊ→": 283,
      "ʊ↑": 284,
      "ʊ↓↑": 285,
      "ʊ↓": 286,
      "ʑ→": 287,
      "ʑ↑": 288,
      "ʑ↓↑": 289,
      "ʑ↓": 290,
      "ʒ→": 291,
      "ʒ↑": 292,
      "ʒ↓↑": 293,
      "ʒ↓": 294,
      "ʰ→": 295,
      "ʰ↑": 296,
      "ʰ↓↑": 297,
      "ʰ↓": 298,
      "ˈ→": 299,
      "ˈ↑": 300,
      "ˈ↓↑": 301,
      "ˈ↓": 302,
      "ˌ→": 303,
      "ˌ↑": 304,
      "ˌ↓↑": 305,
      "ˌ↓": 306,
      "θ→": 306,
      "θ↑": 307,
      "θ↓↑": 308,
      "θ↓": 309,
      "…→": 310,
      "…↑": 311,
      "…↓↑": 312,
      "…↓": 313,
      "⁼→": 314,
      "⁼↑": 315,
      "⁼↓↑": 316,
      "⁼↓": 317
    },
    "merges": [
      "↓ ↑",
      "! →",
      "! ↑",
      "! ↓↑",
      "! ↓",
      "# →",
      "# ↑",
      "# ↓↑",
      "# ↓",
      "* →",
      "* ↑",
      "* ↓↑",
      "* ↓",
      ", →",
      ", ↑",
      ", ↓↑",
      ", ↓",
      "- →",
      "- ↑",
      "- ↓↑",
      "- ↓",
      ". →",
      ". ↑",
      ". ↓↑",
      ". ↓",
      "= →",
      "= ↑",
      "= ↓↑",
      "= ↓",
      "? →",
      "? ↑",
      "? ↓↑",
      "? ↓",
      "N →",
      "N ↑",
      "N ↓↑",
      "N ↓",
      "Q →",
      "Q ↑",
      "Q ↓↑",
      "Q ↓",
      "^ →",
      "^ ↑",
      "^ ↓↑",
      "^ ↓",
      "_ →",
      "_ ↑",
      "_ ↓↑",
      "_ ↓",
      "` →",
      "` ↑",
      "` ↓↑",
      "` ↓",
      "a →",
      "a ↑",
      "a ↓↑",
      "a ↓",
      "b →",
      "b ↑",
      "b ↓↑",
      "b ↓",
      "d →",
      "d ↑",
      "d ↓↑",
      "d ↓",
      "e →",
      "e ↑",
      "e ↓↑",
      "e ↓",
      "f →",
      "f ↑",
      "f ↓↑",
      "f ↓",
      "g →",
      "g ↑",
      "g ↓↑",
      "g ↓",
      "h →",
      "h ↑",
      "h ↓↑",
      "h ↓",
      "i →",
      "i ↑",
      "i ↓↑",
      "i ↓",
      "j →",
      "j ↑",
      "j ↓↑",
      "j ↓",
      "k →",
      "k ↑",
      "k ↓↑",
      "k ↓",
      "l →",
      "l ↑",
      "l ↓↑",
      "l ↓",
      "m →",
      "m ↑",
      "m ↓↑",
      "m ↓",
      "n →",
      "n ↑",
      "n ↓↑",
      "n ↓",
      "o →",
      "o ↑",
      "o ↓↑",
      "o ↓",
      "p →",
      "p ↑",
      "p ↓↑",
      "p ↓",
      "s →",
      "s ↑",
      "s ↓↑",
      "s ↓",
      "t →",
      "t ↑",
      "t ↓↑",
      "t ↓",
      "u →",
      "u ↑",
      "u ↓↑",
      "u ↓",
      "v →",
      "v ↑",
      "v ↓↑",
      "v ↓",
      "w →",
      "w ↑",
      "w ↓↑",
      "w ↓",
      "x →",
      "x ↑",
      "x ↓↑",
      "x ↓",
      "y →",
      "y ↑",
      "y ↓↑",
      "y ↓",
      "z →",
      "z ↑",
      "z ↓↑",
      "z ↓",
      "~ →",
      "~ ↑",
      "~ ↓↑",
      "~ ↓",
      "æ →",
      "æ ↑",
      "æ ↓↑",
      "æ ↓",
      "ç →",
      "ç ↑",
      "ç ↓↑",
      "ç ↓",
      "ð →",
      "ð ↑",
      "ð ↓↑",
      "ð ↓",
      "ŋ →",
      "ŋ ↑",
      "ŋ ↓↑",
      "ŋ ↓",
      "ɑ →",
      "ɑ ↑",
      "ɑ ↓↑",
      "ɑ ↓",
      "ɔ →",
      "ɔ ↑",
      "ɔ ↓↑",
      "ɔ ↓",
      "ə →",
      "ə ↑",
      "ə ↓↑",
      "ə ↓",
      "ɛ →",
      "ɛ ↑",
      "ɛ ↓↑",
      "ɛ ↓",
      "ɥ →",
      "ɥ ↑",
      "ɥ ↓↑",
      "ɥ ↓",
      "ɪ →",
      "ɪ ↑",
      "ɪ ↓↑",
      "ɪ ↓",
      "ɫ →",
      "ɫ ↑",
      "ɫ ↓↑",
      "ɫ ↓",
      "ɯ →",
      "ɯ ↑",
      "ɯ ↓↑",
      "ɯ ↓",
      "ɸ →",
      "ɸ ↑",
      "ɸ ↓↑",
      "ɸ ↓",
      "ɹ →",
      "ɹ ↑",
      "ɹ ↓↑",
      "ɹ ↓",
      "ɾ →",
      "ɾ ↑",
      "ɾ ↓↑",
      "ɾ ↓",
      "ʃ →",
      "ʃ ↑",
      "ʃ ↓↑",
      "ʃ ↓",
      "ʊ →",
      "ʊ ↑",
      "ʊ ↓↑",
      "ʊ ↓",
      "ʑ →",
      "ʑ ↑",
      "ʑ ↓↑",
      "ʑ ↓",
      "ʒ →",
      "ʒ ↑",
      "ʒ ↓↑",
      "ʒ ↓",
      "ʰ →",
      "ʰ ↑",
      "ʰ ↓↑",
      "ʰ ↓",
      "ˈ →",
      "ˈ ↑",
      "ˈ ↓↑",
      "ˈ ↓",
      "ˌ →",
      "ˌ ↑",
      "ˌ ↓↑",
      "ˌ ↓",
      "θ →",
      "θ ↑",
      "θ ↓↑",
      "θ ↓",
      "… →",
      "… ↑",
      "… ↓↑",
      "… ↓",
      "⁼ →",
      "⁼ ↑",
      "⁼ ↓↑",
      "⁼ ↓"
    ]
  }
}