{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "[UNK]",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "vocab": {
      "[UNK]": 0,
      "[CLS]": 1,
      "[SEP]": 2,
      "[PAD]": 3,
      "[MASK]": 4,
      "!": 5,
      "#": 6,
      "*": 7,
      ",": 8,
      "-": 9,
      ".": 10,
      "=": 11,
      "?": 12,
      "N": 13,
      "Q": 14,
      "^": 15,
      "_": 16,
      "`": 17,
      "a": 18,
      "b": 19,
      "d": 20,
      "e": 21,
      "f": 22,
      "g": 23,
      "h": 24,
      "i": 25,
      "j": 26,
      "k": 27,
      "l": 28,
      "m": 29,
      "n": 30,
      "o": 31,
      "p": 32,
      "s": 33,
      "t": 34,
      "u": 35,
      "v": 36,
      "w": 37,
      "x": 38,
      "y": 39,
      "z": 40,
      "~": 41,
      "æ": 42,
      "ç": 43,
      "ð": 44,
      "ŋ": 45,
      "ɑ": 46,
      "ɔ": 47,
      "ə": 48,
      "ɛ": 49,
      "ɥ": 50,
      "ɪ": 51,
      "ɫ": 52,
      "ɯ": 53,
      "ɸ": 54,
      "ɹ": 55,
      "ɾ": 56,
      "ʃ": 57,
      "ʊ": 58,
      "ʑ": 59,
      "ʒ": 60,
      "ʰ": 61,
      "ˈ": 62,
      "ˌ": 63,
      "θ": 64,
      "…": 65,
      "⁼": 66,

      "wo": 67,
      "p⁼": 68,
      "pʰ": 69,
      "p⁼wo": 70,
      "pʰwo": 71,
      "mwo": 72,
      "fwo": 73,

      "t⁼": 74,
      "tʰ": 75,
      "k⁼": 76,
      "kʰ": 77,

      "tʃ": 78,
      "tʃ⁼": 79,
      "tʃʰ": 80,
      
      "ts": 81,
      "ts⁼": 82,
      "ts`": 83,
      "tsʰ" :84,

      "ts`⁼": 85,
      "ts`ʰ": 86,

      "s`": 87,
      "ɹ`": 88,
      "s`ɹ`": 89,
      "ɹ`ɹ`": 90,
      "ts`⁼ɹ`": 91,
      "ts`ʰɹ`": 92,

      "ts⁼ɹ": 93,
      "tsʰɹ": 94,
      "sɹ": 95,

      "aɪ": 96,
      "eɪ": 97,
      "ɑʊ": 98,
      "oʊ": 99,

      "jɛ": 100,
      "jɛn": 101,
      "ɥæ": 102,
      "ɥæn": 103,

      "an": 104,
      "in": 105,
      "ɥn": 106,
      "ən": 107,
      "ɑŋ": 108,
      "iŋ": 109,
      "ʊŋ": 110,
      "jʊŋ": 111,
      "əŋ": 112,
      "əɹ`": 113,

      "ja": 114,
      "iɛ": 115, 
      "iɑʊ": 116,
      "joʊ": 117,
      "iɑŋ": 118,
      "wa": 119,
      "waɪ": 120,
      "weɪ": 121,
      "wan": 122,
      "wən": 123,
      "uɑŋ": 124,
      "ɥɛ": 125,

      "→": 126,
      "↑": 127,
      "↓↑": 128,
      "↓": 129,
      "!→": 130,
      "!↑": 131,
      "!↓↑": 132,
      "!↓": 133,
      "#→": 134,
      "#↑": 135,
      "#↓↑": 136,
      "#↓": 137,
      "*→": 138,
      "*↑": 139,
      "*↓↑": 140,
      "*↓": 141,
      ",→": 142,
      ",↑": 143,
      ",↓↑": 144,
      ",↓": 145,
      "-→": 146,
      "-↑": 147,
      "-↓↑": 148,
      "-↓": 149,
      ".→": 150,
      ".↑": 151,
      ".↓↑": 152,
      ".↓": 153,
      "=→": 154,
      "=↑": 155,
      "=↓↑": 156,
      "=↓": 157,
      "?→": 158,
      "?↑": 159,
      "?↓↑": 160,
      "?↓": 161,
      "N→": 162,
      "N↑": 163,
      "N↓↑": 164,
      "N↓": 165,
      "Q→": 166,
      "Q↑": 167,
      "Q↓↑": 168,
      "Q↓": 169,
      "^→": 170,
      "^↑": 171,
      "^↓↑": 172,
      "^↓": 173,
      "_→": 174,
      "_↑": 175,
      "_↓↑": 176,
      "_↓": 177,
      "`→": 178,
      "`↑": 179,
      "`↓↑": 180,
      "`↓": 181,
      "a→": 182,
      "a↑": 183,
      "a↓↑": 184,
      "a↓": 185,
      "b→": 186,
      "b↑": 187,
      "b↓↑": 188,
      "b↓": 189,
      "d→": 190,
      "d↑": 191,
      "d↓↑": 192,
      "d↓": 193,
      "e→": 194,
      "e↑": 195,
      "e↓↑": 196,
      "e↓": 197,
      "f→": 198,
      "f↑": 199,
      "f↓↑": 200,
      "f↓": 201,
      "g→": 202,
      "g↑": 203,
      "g↓↑": 204,
      "g↓": 205,
      "h→": 206,
      "h↑": 207,
      "h↓↑": 208,
      "h↓": 209,
      "i→": 210,
      "i↑": 211,
      "i↓↑": 212,
      "i↓": 213,
      "j→": 214,
      "j↑": 215,
      "j↓↑": 216,
      "j↓": 217,
      "k→": 218,
      "k↑": 219,
      "k↓↑": 220,
      "k↓": 221,
      "l→": 222,
      "l↑": 223,
      "l↓↑": 224,
      "l↓": 225,
      "m→": 226,
      "m↑": 227,
      "m↓↑": 228,
      "m↓": 229,
      "n→": 230,
      "n↑": 231,
      "n↓↑": 232,

      "n↓": 233,
      "o→": 234,
      "o↑": 235,
      "o↓↑": 236,
      "o↓": 237,
      "p→": 238,
      "p↑": 239,
      "p↓↑": 240,
      "p↓": 241,
      "s→": 242,
      "s↑": 243,
      "s↓↑": 244,
      "s↓": 245,
      "t→": 246,
      "t↑": 247,
      "t↓↑": 248,
      "t↓": 249,
      "u→": 250,
      "u↑": 251,
      "u↓↑": 252,
      "u↓": 253,
      "v→": 254,
      "v↑": 255,
      "v↓↑": 256,
      "v↓": 257,
      "w→": 258,
      "w↑": 259,
      "w↓↑": 260,
      "w↓": 261,
      "x→": 262,
      "x↑": 263,
      "x↓↑": 264,
      "x↓": 265,
      "y→": 266,
      "y↑": 267,
      "y↓↑": 268,
      "y↓": 269,
      "z→": 270,
      "z↑": 271,
      "z↓↑": 272,
      "z↓": 273,
      "~→": 274,
      "~↑": 275,
      "~↓↑": 276,
      "~↓": 277,
      "æ→": 278,
      "æ↑": 279,
      "æ↓↑": 280,
      "æ↓": 281,
      "ç→": 282,
      "ç↑": 283,
      "ç↓↑": 284,
      "ç↓": 285,
      "ð→": 286,
      "ð↑": 287,
      "ð↓↑": 288,
      "ð↓": 289,
      "ŋ→": 290,
      "ŋ↑": 291,
      "ŋ↓↑": 292,
      "ŋ↓": 293,
      "ɑ→": 294,
      "ɑ↑": 295,
      "ɑ↓↑": 296,
      "ɑ↓": 297,
      "ɔ→": 298,
      "ɔ↑": 299,
      "ɔ↓↑": 300,
      "ɔ↓": 301,
      "ə→": 302,
      "ə↑": 303,
      "ə↓↑": 304,
      "ə↓": 305,
      "ɛ→": 306,
      "ɛ↑": 307,
      "ɛ↓↑": 308,
      "ɛ↓": 309,
      "ɥ→": 310,
      "ɥ↑": 311,
      "ɥ↓↑": 312,
      "ɥ↓": 313,
      "ɪ→": 314,
      "ɪ↑": 315,
      "ɪ↓↑": 316,
      "ɪ↓": 317,
      "ɫ→": 318,
      "ɫ↑": 319,
      "ɫ↓↑": 320,
      "ɫ↓": 321,
      "ɯ→": 322,
      "ɯ↑": 323,
      "ɯ↓↑": 324,
      "ɯ↓": 325,
      "ɸ→": 326,
      "ɸ↑": 327,
      "ɸ↓↑": 328,
      "ɸ↓": 329,
      "ɹ→": 330,
      "ɹ↑": 331,
      "ɹ↓↑": 332,
      "ɹ↓": 333,
      "ɾ→": 334,
      "ɾ↑": 335,
      "ɾ↓↑": 336,
      "ɾ↓": 337,
      "ʃ→": 338,
      "ʃ↑": 339,
      "ʃ↓↑": 340,
      "ʃ↓": 341,
      "ʊ→": 342,
      "ʊ↑": 343,
      "ʊ↓↑": 344,
      "ʊ↓": 345,
      "ʑ→": 346,
      "ʑ↑": 347,
      "ʑ↓↑": 348,
      "ʑ↓": 349,
      "ʒ→": 350,
      "ʒ↑": 351,
      "ʒ↓↑": 352,
      "ʒ↓": 353,
      "ʰ→": 354,
      "ʰ↑": 355,
      "ʰ↓↑": 356,
      "ʰ↓": 357,
      "ˈ→": 358,
      "ˈ↑": 359,
      "ˈ↓↑": 360,
      "ˈ↓": 361,
      "ˌ→": 362,
      "ˌ↑": 363,
      "ˌ↓↑": 364,
      "ˌ↓": 365,
      "θ→": 366,
      "θ↑": 367,
      "θ↓↑": 368,
      "θ↓": 369,
      "…→": 370,
      "…↑": 371,
      "…↓↑": 372,
      "…↓": 373,
      "⁼→": 374,
      "⁼↑": 375,
      "⁼↓↑": 376,
      "⁼↓": 377,

      "wo→": 378,
      "wo↑": 379,
      "wo↓↑": 380,
      "wo↓": 381,

      "p⁼→": 382,
      "p⁼↑": 383,
      "p⁼↓↑": 384,
      "p⁼↓": 385,

      "pʰ→": 386,
      "pʰ↑": 387,
      "pʰ↓↑": 388,
      "pʰ↓": 389,

      "p⁼wo→": 390,
      "p⁼wo↑": 391,
      "p⁼wo↓↑": 392,
      "p⁼wo↓": 393,

      "pʰwo→": 394,
      "pʰwo↑": 395,
      "pʰwo↓↑": 396,
      "pʰwo↓": 397,

      "mwo→": 398,
      "mwo↑": 399,
      "mwo↓↑": 400,
      "mwo↓": 401,

      "fwo→": 402,
      "fwo↑": 403,
      "fwo↓↑": 404,
      "fwo↓": 405,

      "t⁼→": 406,
      "t⁼↑": 407,
      "t⁼↓↑": 408,
      "t⁼↓": 409,

      "tʰ→": 410,
      "tʰ↑": 411,
      "tʰ↓↑": 412,
      "tʰ↓": 413,

      "k⁼→": 414,
      "k⁼↑": 415,
      "k⁼↓↑": 416,
      "k⁼↓": 417,

      "kʰ→": 418,
      "kʰ↑": 419,
      "kʰ↓↑": 420,
      "kʰ↓": 421,

      "tʃ→": 422,
      "tʃ↑": 423,
      "tʃ↓↑": 424,
      "tʃ↓": 425,

      "tʃ⁼→": 426,
      "tʃ⁼↑": 427,
      "tʃ⁼↓↑": 428,
      "tʃ⁼↓": 429,

      "tʃʰ→": 430,
      "tʃʰ↑": 431,
      "tʃʰ↓↑": 432,
      "tʃʰ↓": 433,
      
      "ts→": 434,
      "ts↑": 435,
      "ts↓↑": 436,
      "ts↓": 437,

      "ts⁼→": 438,
      "ts⁼↑": 439,
      "ts⁼↓↑": 440,
      "ts⁼↓": 441,

      "ts`→": 442,
      "ts`↑": 443,
      "ts`↓↑": 444,
      "ts`↓": 445,

      "tsʰ→": 446,
      "tsʰ↑": 447,
      "tsʰ↓↑": 448,
      "tsʰ↓": 449,

      "ts`⁼→": 450,
      "ts`⁼↑": 451,
      "ts`⁼↓↑": 452,
      "ts`⁼↓": 453,

      "ts`ʰ→": 454,
      "ts`ʰ↑": 455,
      "ts`ʰ↓↑": 456,
      "ts`ʰ↓": 457,

      "s`→": 458,
      "s`↑": 459,
      "s`↓↑": 460,
      "s`↓": 461,

      "ɹ`→": 462,
      "ɹ`↑": 463,
      "ɹ`↓↑": 464,
      "ɹ`↓": 465,

      "s`ɹ`→": 466,
      "s`ɹ`↑": 467,
      "s`ɹ`↓↑": 468,
      "s`ɹ`↓": 469,

      "ɹ`ɹ`→": 470,
      "ɹ`ɹ`↑": 471,
      "ɹ`ɹ`↓↑": 472,
      "ɹ`ɹ`↓": 473,

      "ts`⁼ɹ`→": 474,
      "ts`⁼ɹ`↑": 475,
      "ts`⁼ɹ`↓↑": 476,
      "ts`⁼ɹ`↓": 477,

      "ts`ʰɹ`→": 478,
      "ts`ʰɹ`↑": 479,
      "ts`ʰɹ`↓↑": 480,
      "ts`ʰɹ`↓": 481,

      "ts⁼ɹ→": 482,
      "ts⁼ɹ↑": 483,
      "ts⁼ɹ↓↑": 484,
      "ts⁼ɹ↓": 485,

      "tsʰɹ→": 486,
      "tsʰɹ↑": 487,
      "tsʰɹ↓↑": 488,
      "tsʰɹ↓": 489,

      "sɹ→": 490,
      "sɹ↑": 491,
      "sɹ↓↑": 492,
      "sɹ↓": 493,

      "aɪ→": 494,
      "aɪ↑": 495,
      "aɪ↓↑": 496,
      "aɪ↓": 497,

      "eɪ→": 498,
      "eɪ↑": 499,
      "eɪ↓↑": 500,
      "eɪ↓": 501,

      "ɑʊ→": 502,
      "ɑʊ↑": 503,
      "ɑʊ↓↑": 504,
      "ɑʊ↓": 505,

      "oʊ→": 506,
      "oʊ↑": 507,
      "oʊ↓↑": 508,
      "oʊ↓": 509,

      "jɛ→": 510,
      "jɛ↑": 511,
      "jɛ↓↑": 512,
      "jɛ↓": 513,

      "jɛn→": 514,
      "jɛn↑": 515,
      "jɛn↓↑": 516,
      "jɛn↓": 517,

      "ɥæ→": 518,
      "ɥæ↑": 519,
      "ɥæ↓↑": 520,
      "ɥæ↓": 521,

      "ɥæn→": 522,
      "ɥæn↑": 523,
      "ɥæn↓↑": 524,
      "ɥæn↓": 525,

      "an→": 526,
      "an↑": 527,
      "an↓↑": 528,
      "an↓": 529,

      "in→": 530,
      "in↑": 531,
      "in↓↑": 532,
      "in↓": 533,

      "ɥn→": 534,
      "ɥn↑": 535,
      "ɥn↓↑": 536,
      "ɥn↓": 537,

      "ən→": 538,
      "ən↑": 539,
      "ən↓↑": 540,
      "ən↓": 541,

      "ɑŋ→": 542,
      "ɑŋ↑": 543,
      "ɑŋ↓↑": 544,
      "ɑŋ↓": 545,

      "iŋ→": 546,
      "iŋ↑": 547,
      "iŋ↓↑": 548,
      "iŋ↓": 549,

      "ʊŋ→": 550,
      "ʊŋ↑": 551,
      "ʊŋ↓↑": 552,
      "ʊŋ↓": 553,

      "jʊŋ→": 554,
      "jʊŋ↑": 555,
      "jʊŋ↓↑": 556,
      "jʊŋ↓": 557,

      "əŋ→": 558,
      "əŋ↑": 559,
      "əŋ↓↑": 560,
      "əŋ↓": 561,

      "əɹ`→": 562,
      "əɹ`↑": 563,
      "əɹ`↓↑": 564,
      "əɹ`↓": 565,

      "ja→": 566,
      "ja↑": 567,
      "ja↓↑": 568,
      "ja↓": 569,

      "iɛ→": 570, 
      "iɛ↑": 571, 
      "iɛ↓↑": 572, 
      "iɛ↓": 573, 

      "iɑʊ→": 574,
      "iɑʊ↑": 575,
      "iɑʊ↓↑": 576,
      "iɑʊ↓": 577,

      "joʊ→": 578,
      "joʊ↑": 579,
      "joʊ↓↑": 580,
      "joʊ↓": 581,

      "iɑŋ→": 582,
      "iɑŋ↑": 583,
      "iɑŋ↓↑": 584,
      "iɑŋ↓": 585,

      "wa→": 586,
      "wa↑": 587,
      "wa↓↑": 588,
      "wa↓": 589,

      "waɪ→": 590,
      "waɪ↑": 591,
      "waɪ↓↑": 592,
      "waɪ↓": 593,

      "weɪ→": 594,
      "weɪ↑": 595,
      "weɪ↓↑": 596,
      "weɪ↓": 597,

      "wan→": 598,
      "wan↑": 599,
      "wan↓↑": 600,
      "wan↓": 601,

      "wən→": 602,
      "wən↑": 603,
      "wən↓↑": 604,
      "wən↓": 605,

      "uɑŋ→": 606,
      "uɑŋ↑": 607,
      "uɑŋ↓↑": 608,
      "uɑŋ↓": 609,

      "ɥɛ→": 610,
      "ɥɛ↑": 611,
      "ɥɛ↓↑": 612,
      "ɥɛ↓": 613,

      "ɐ": 614,
      "ɕ": 615,
      "ʌ": 616,
      "c": 617,
      "q": 618,
      "r": 619,
      "ɡ": 620,
      "jɐ": 621,
      "jʌ": 622,
      "jo": 623,
      "ju": 624,
      "je": 625,
      "we": 626,
      "wi": 627,
      "ɯj": 628,
      "wɐ": 629,
      "wɛ": 630,
      "wʌ": 631,
      "tɕ": 632,
      "tɕʰ": 633,


      "ʁ": 634,
      "ɲ": 635,
      "œ": 636,
      ":": 637,
      "jˈ": 638,
      "ˈn": 639,
      "wˈ": 640,


      "tˈ": 641,
      "ˈŋ": 642,
      "ˈɪ": 643
    },
    "merges": [
      "↓ ↑",
      "w o",
      "p ⁼",
      "p ʰ",
      "p⁼ wo",
      "pʰ wo",
      "m wo",
      "f wo",

      "t ⁼",
      "t ʰ",
      "k ⁼",
      "k ʰ",

      "t ʃ",
      "tʃ ⁼",
      "tʃ ʰ",
      
      "t s",
      "ts ⁼",
      "ts `",
      "ts ʰ",

      "ts` ⁼",
      "ts` ʰ",

      "s `",
      "ɹ `",
      "s` ɹ`",
      "ɹ` ɹ`",
      "ts`⁼ ɹ`",
      "ts`ʰ ɹ`",

      "ts⁼ ɹ",
      "tsʰ ɹ",
      "s ɹ",

      "a ɪ",
      "e ɪ",
      "ɑ ʊ",
      "o ʊ",

      "j ɛ",
      "jɛ n",
      "ɥ æ",
      "ɥæ n",

      "a n",
      "i n",
      "ɥ n",
      "ə n",
      "ɑ ŋ",
      "i ŋ",
      "ʊ ŋ",
      "j ʊŋ",
      "ə ŋ",
      "ə ɹ`",

      "j a",
      "i ɛ", 
      "i ɑʊ",
      "jo ʊ",
      "i ɑŋ",
      "w a",
      "w aɪ",
      "we ɪ",
      "w an",
      "w ən",
      "u ɑŋ",
      "ɥ ɛ",

      "! →",
      "! ↑",
      "! ↓↑",
      "! ↓",
      "# →",
      "# ↑",
      "# ↓↑",
      "# ↓",
      "* →",
      "* ↑",
      "* ↓↑",
      "* ↓",
      ", →",
      ", ↑",
      ", ↓↑",
      ", ↓",
      "- →",
      "- ↑",
      "- ↓↑",
      "- ↓",
      ". →",
      ". ↑",
      ". ↓↑",
      ". ↓",
      "= →",
      "= ↑",
      "= ↓↑",
      "= ↓",
      "? →",
      "? ↑",
      "? ↓↑",
      "? ↓",
      "N →",
      "N ↑",
      "N ↓↑",
      "N ↓",
      "Q →",
      "Q ↑",
      "Q ↓↑",
      "Q ↓",
      "^ →",
      "^ ↑",
      "^ ↓↑",
      "^ ↓",
      "_ →",
      "_ ↑",
      "_ ↓↑",
      "_ ↓",
      "a →",
      "a ↑",
      "a ↓↑",
      "a ↓",
      "b →",
      "b ↑",
      "b ↓↑",
      "b ↓",
      "d →",
      "d ↑",
      "d ↓↑",
      "d ↓",
      "e →",
      "e ↑",
      "e ↓↑",
      "e ↓",
      "f →",
      "f ↑",
      "f ↓↑",
      "f ↓",
      "g →",
      "g ↑",
      "g ↓↑",
      "g ↓",
      "h →",
      "h ↑",
      "h ↓↑",
      "h ↓",
      "i →",
      "i ↑",
      "i ↓↑",
      "i ↓",
      "j →",
      "j ↑",
      "j ↓↑",
      "j ↓",
      "k →",
      "k ↑",
      "k ↓↑",
      "k ↓",
      "l →",
      "l ↑",
      "l ↓↑",
      "l ↓",
      "m →",
      "m ↑",
      "m ↓↑",
      "m ↓",
      "n →",
      "n ↑",
      "n ↓↑",
      "n ↓",
      "o →",
      "o ↑",
      "o ↓↑",
      "o ↓",
      "p →",
      "p ↑",
      "p ↓↑",
      "p ↓",
      "s →",
      "s ↑",
      "s ↓↑",
      "s ↓",
      "t →",
      "t ↑",
      "t ↓↑",
      "t ↓",
      "u →",
      "u ↑",
      "u ↓↑",
      "u ↓",
      "v →",
      "v ↑",
      "v ↓↑",
      "v ↓",
      "w →",
      "w ↑",
      "w ↓↑",
      "w ↓",
      "x →",
      "x ↑",
      "x ↓↑",
      "x ↓",
      "y →",
      "y ↑",
      "y ↓↑",
      "y ↓",
      "z →",
      "z ↑",
      "z ↓↑",
      "z ↓",
      "~ →",
      "~ ↑",
      "~ ↓↑",
      "~ ↓",
      "æ →",
      "æ ↑",
      "æ ↓↑",
      "æ ↓",
      "ç →",
      "ç ↑",
      "ç ↓↑",
      "ç ↓",
      "ð →",
      "ð ↑",
      "ð ↓↑",
      "ð ↓",
      "ŋ →",
      "ŋ ↑",
      "ŋ ↓↑",
      "ŋ ↓",
      "ɑ →",
      "ɑ ↑",
      "ɑ ↓↑",
      "ɑ ↓",
      "ɔ →",
      "ɔ ↑",
      "ɔ ↓↑",
      "ɔ ↓",
      "ə →",
      "ə ↑",
      "ə ↓↑",
      "ə ↓",
      "ɛ →",
      "ɛ ↑",
      "ɛ ↓↑",
      "ɛ ↓",
      "ɥ →",
      "ɥ ↑",
      "ɥ ↓↑",
      "ɥ ↓",
      "ɪ →",
      "ɪ ↑",
      "ɪ ↓↑",
      "ɪ ↓",
      "ɫ →",
      "ɫ ↑",
      "ɫ ↓↑",
      "ɫ ↓",
      "ɯ →",
      "ɯ ↑",
      "ɯ ↓↑",
      "ɯ ↓",
      "ɸ →",
      "ɸ ↑",
      "ɸ ↓↑",
      "ɸ ↓",
      "ɹ →",
      "ɹ ↑",
      "ɹ ↓↑",
      "ɹ ↓",
      "ɾ →",
      "ɾ ↑",
      "ɾ ↓↑",
      "ɾ ↓",
      "ʃ →",
      "ʃ ↑",
      "ʃ ↓↑",
      "ʃ ↓",
      "ʊ →",
      "ʊ ↑",
      "ʊ ↓↑",
      "ʊ ↓",
      "ʑ →",
      "ʑ ↑",
      "ʑ ↓↑",
      "ʑ ↓",
      "ʒ →",
      "ʒ ↑",
      "ʒ ↓↑",
      "ʒ ↓",
      "ʰ →",
      "ʰ ↑",
      "ʰ ↓↑",
      "ʰ ↓",
      "ˈ →",
      "ˈ ↑",
      "ˈ ↓↑",
      "ˈ ↓",
      "ˌ →",
      "ˌ ↑",
      "ˌ ↓↑",
      "ˌ ↓",
      "θ →",
      "θ ↑",
      "θ ↓↑",
      "θ ↓",
      "… →",
      "… ↑",
      "… ↓↑",
      "… ↓",
      "⁼ →",
      "⁼ ↑",
      "⁼ ↓↑",
      "⁼ ↓",
      "wo →",
      "wo ↑",
      "wo ↓↑",
      "wo ↓",

      "p⁼ →",
      "p⁼ ↑",
      "p⁼ ↓↑",
      "p⁼ ↓",

      "pʰ →",
      "pʰ ↑",
      "pʰ ↓↑",
      "pʰ ↓",

      "p⁼wo →",
      "p⁼wo ↑",
      "p⁼wo ↓↑",
      "p⁼wo ↓",

      "pʰwo →",
      "pʰwo ↑",
      "pʰwo ↓↑",
      "pʰwo ↓",

      "mwo →",
      "mwo ↑",
      "mwo ↓↑",
      "mwo ↓",

      "fwo →",
      "fwo ↑",
      "fwo ↓↑",
      "fwo ↓",

      "t⁼ →",
      "t⁼ ↑",
      "t⁼ ↓↑",
      "t⁼ ↓",

      "tʰ →",
      "tʰ ↑",
      "tʰ ↓↑",
      "tʰ ↓",

      "k⁼ →",
      "k⁼ ↑",
      "k⁼ ↓↑",
      "k⁼ ↓",

      "kʰ →",
      "kʰ ↑",
      "kʰ ↓↑",
      "kʰ ↓",

      "tʃ →",
      "tʃ ↑",
      "tʃ ↓↑",
      "tʃ ↓",

      "tʃ⁼ →",
      "tʃ⁼ ↑",
      "tʃ⁼ ↓↑",
      "tʃ⁼ ↓",

      "tʃʰ →",
      "tʃʰ ↑",
      "tʃʰ ↓↑",
      "tʃʰ ↓",
      
      "ts →",
      "ts ↑",
      "ts ↓↑",
      "ts ↓",

      "ts⁼ →",
      "ts⁼ ↑",
      "ts⁼ ↓↑",
      "ts⁼ ↓",

      "ts` →",
      "ts` ↑",
      "ts` ↓↑",
      "ts` ↓",

      "tsʰ →",
      "tsʰ ↑",
      "tsʰ ↓↑",
      "tsʰ ↓",

      "ts`⁼ →",
      "ts`⁼ ↑",
      "ts`⁼ ↓↑",
      "ts`⁼ ↓",

      "ts`ʰ →",
      "ts`ʰ ↑",
      "ts`ʰ ↓↑",
      "ts`ʰ ↓",

      "s` →",
      "s` ↑",
      "s` ↓↑",
      "s` ↓",

      "ɹ` →",
      "ɹ` ↑",
      "ɹ` ↓↑",
      "ɹ` ↓",

      "s`ɹ` →",
      "s`ɹ` ↑",
      "s`ɹ` ↓↑",
      "s`ɹ` ↓",

      "ɹ`ɹ` →",
      "ɹ`ɹ` ↑",
      "ɹ`ɹ` ↓↑",
      "ɹ`ɹ` ↓",

      "ts`⁼ɹ` →",
      "ts`⁼ɹ` ↑",
      "ts`⁼ɹ` ↓↑",
      "ts`⁼ɹ` ↓",

      "ts`ʰɹ` →",
      "ts`ʰɹ` ↑",
      "ts`ʰɹ` ↓↑",
      "ts`ʰɹ` ↓",

      "ts⁼ɹ →",
      "ts⁼ɹ ↑",
      "ts⁼ɹ ↓↑",
      "ts⁼ɹ ↓",

      "tsʰɹ →",
      "tsʰɹ ↑",
      "tsʰɹ ↓↑",
      "tsʰɹ ↓",

      "sɹ →",
      "sɹ ↑",
      "sɹ ↓↑",
      "sɹ ↓",

      "aɪ →",
      "aɪ ↑",
      "aɪ ↓↑",
      "aɪ ↓",

      "eɪ →",
      "eɪ ↑",
      "eɪ ↓↑",
      "eɪ ↓",

      "ɑʊ →",
      "ɑʊ ↑",
      "ɑʊ ↓↑",
      "ɑʊ ↓",

      "oʊ →",
      "oʊ ↑",
      "oʊ ↓↑",
      "oʊ ↓",

      "jɛ →",
      "jɛ ↑",
      "jɛ ↓↑",
      "jɛ ↓",

      "jɛn →",
      "jɛn ↑",
      "jɛn ↓↑",
      "jɛn ↓",

      "ɥæ →",
      "ɥæ ↑",
      "ɥæ ↓↑",
      "ɥæ ↓",

      "ɥæn →",
      "ɥæn ↑",
      "ɥæn ↓↑",
      "ɥæn ↓",

      "an →",
      "an ↑",
      "an ↓↑",
      "an ↓",

      "in →",
      "in ↑",
      "in ↓↑",
      "in ↓",

      "ɥn →",
      "ɥn ↑",
      "ɥn ↓↑",
      "ɥn ↓",

      "ən →",
      "ən ↑",
      "ən ↓↑",
      "ən ↓",

      "ɑŋ →",
      "ɑŋ ↑",
      "ɑŋ ↓↑",
      "ɑŋ ↓",

      "iŋ →",
      "iŋ ↑",
      "iŋ ↓↑",
      "iŋ ↓",

      "ʊŋ →",
      "ʊŋ ↑",
      "ʊŋ ↓↑",
      "ʊŋ ↓",

      "jʊŋ →",
      "jʊŋ ↑",
      "jʊŋ ↓↑",
      "jʊŋ ↓",

      "əŋ →",
      "əŋ ↑",
      "əŋ ↓↑",
      "əŋ ↓",

      "əɹ` →",
      "əɹ` ↑",
      "əɹ` ↓↑",
      "əɹ` ↓",
      

      "j ɐ",
      "j ʌ",
      "j o",
      "j u",
      "j e",
      "w e",
      "w i",
      "ɯ j",
      "w ɐ",
      "w ɛ",
      "w ʌ",
      "t ɕ",
      "tɕ ʰ",


      "j ˈ",
      "ˈ n",
      "w ˈ",

      
      "t ˈ",
      "ˈ ŋ",
      "ˈ ɪ"
    ]
  }
}