{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "[UNK]",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "vocab": {
      "[UNK]": 0,
      "[CLS]": 1,
      "[SEP]": 2,
      "[PAD]": 3,
      "[MASK]": 4,
      "!": 5,
      "#": 6,
      "*": 7,
      ",": 8,
      "-": 9,
      ".": 10,
      "=": 11,
      "?": 12,
      "N": 13,
      "Q": 14,
      "^": 15,
      "_": 16,
      "`": 17,
      "a": 18,
      "b": 19,
      "d": 20,
      "e": 21,
      "f": 22,
      "g": 23,
      "h": 24,
      "i": 25,
      "j": 26,
      "k": 27,
      "l": 28,
      "m": 29,
      "n": 30,
      "o": 31,
      "p": 32,
      "s": 33,
      "t": 34,
      "u": 35,
      "v": 36,
      "w": 37,
      "x": 38,
      "y": 39,
      "z": 40,
      "~": 41,
      "æ": 42,
      "ç": 43,
      "ð": 44,
      "ŋ": 45,
      "ɑ": 46,
      "ɔ": 47,
      "ə": 48,
      "ɛ": 49,
      "ɥ": 50,
      "ɪ": 51,
      "ɫ": 52,
      "ɯ": 53,
      "ɸ": 54,
      "ɹ": 55,
      "ɾ": 56,
      "ʃ": 57,
      "ʊ": 58,
      "ʑ": 59,
      "ʒ": 60,
      "ʰ": 61,
      "ˈ": 62,
      "ˌ": 63,
      "θ": 64,
      "…": 65,
      "⁼": 66,

      "wo": 67,
      "p⁼": 68,
      "pʰ": 69,
      "p⁼wo": 70,
      "pʰwo": 71,
      "mwo": 72,
      "fwo": 73,

      "t⁼": 74,
      "tʰ": 75,
      "k⁼": 76,
      "kʰ": 77,

      "tʃ": 78,
      "tʃ⁼": 79,
      "tʃʰ": 80,
      
      "ts": 81,
      "ts⁼": 82,
      "ts`": 83,
      "tsʰ" :84,

      "ts`⁼": 85,
      "ts`ʰ": 86,

      "s`": 87,
      "ɹ`": 88,
      "s`ɹ`": 89,
      "ɹ`ɹ`": 90,
      "ts`⁼ɹ`": 91,
      "ts`ʰɹ`": 92,

      "ts⁼ɹ": 93,
      "tsʰɹ": 94,
      "sɹ": 95,

      "aɪ": 96,
      "eɪ": 97,
      "ɑʊ": 98,
      "oʊ": 99,

      "jɛ": 100,
      "jɛn": 101,
      "ɥæ": 102,
      "ɥæn": 103,

      "an": 104,
      "in": 105,
      "ɥn": 106,
      "ən": 107,
      "ɑŋ": 108,
      "iŋ": 109,
      "ʊŋ": 110,
      "jʊŋ": 110,
      "əŋ": 112,
      "əɹ`": 113,


      "→": 114,
      "↑": 115,
      "↓↑": 116,
      "↓": 117,
      "!→": 118,
      "!↑": 119,
      "!↓↑": 120,
      "!↓": 121,
      "#→": 122,
      "#↑": 123,
      "#↓↑": 124,
      "#↓": 125,
      "*→": 126,
      "*↑": 127,
      "*↓↑": 128,
      "*↓": 129,
      ",→": 130,
      ",↑": 131,
      ",↓↑": 132,
      ",↓": 133,
      "-→": 134,
      "-↑": 135,
      "-↓↑": 136,
      "-↓": 137,
      ".→": 138,
      ".↑": 139,
      ".↓↑": 140,
      ".↓": 141,
      "=→": 142,
      "=↑": 143,
      "=↓↑": 144,
      "=↓": 145,
      "?→": 146,
      "?↑": 147,
      "?↓↑": 148,
      "?↓": 149,
      "N→": 150,
      "N↑": 151,
      "N↓↑": 152,
      "N↓": 153,
      "Q→": 154,
      "Q↑": 155,
      "Q↓↑": 156,
      "Q↓": 157,
      "^→": 158,
      "^↑": 159,
      "^↓↑": 160,
      "^↓": 161,
      "_→": 162,
      "_↑": 163,
      "_↓↑": 164,
      "_↓": 165,
      "`→": 166,
      "`↑": 167,
      "`↓↑": 168,
      "`↓": 169,
      "a→": 170,
      "a↑": 171,
      "a↓↑": 172,
      "a↓": 173,
      "b→": 174,
      "b↑": 175,
      "b↓↑": 176,
      "b↓": 177,
      "d→": 178,
      "d↑": 179,
      "d↓↑": 180,
      "d↓": 181,
      "e→": 182,
      "e↑": 183,
      "e↓↑": 184,
      "e↓": 185,
      "f→": 186,
      "f↑": 187,
      "f↓↑": 188,
      "f↓": 189,
      "g→": 190,
      "g↑": 191,
      "g↓↑": 192,
      "g↓": 193,
      "h→": 194,
      "h↑": 195,
      "h↓↑": 196,
      "h↓": 197,
      "i→": 198,
      "i↑": 199,
      "i↓↑": 200,
      "i↓": 201,
      "j→": 202,
      "j↑": 203,
      "j↓↑": 204,
      "j↓": 205,
      "k→": 206,
      "k↑": 207,
      "k↓↑": 208,
      "k↓": 209,
      "l→": 210,
      "l↑": 211,
      "l↓↑": 212,
      "l↓": 213,
      "m→": 214,
      "m↑": 215,
      "m↓↑": 216,
      "m↓": 217,
      "n→": 218,
      "n↑": 219,
      "n↓↑": 220,

      "n↓": 221,
      "o→": 222,
      "o↑": 223,
      "o↓↑": 224,
      "o↓": 225,
      "p→": 226,
      "p↑": 227,
      "p↓↑": 228,
      "p↓": 229,
      "s→": 230,
      "s↑": 231,
      "s↓↑": 232,
      "s↓": 233,
      "t→": 234,
      "t↑": 235,
      "t↓↑": 236,
      "t↓": 237,
      "u→": 238,
      "u↑": 239,
      "u↓↑": 240,
      "u↓": 241,
      "v→": 242,
      "v↑": 243,
      "v↓↑": 244,
      "v↓": 245,
      "w→": 246,
      "w↑": 247,
      "w↓↑": 248,
      "w↓": 249,
      "x→": 250,
      "x↑": 251,
      "x↓↑": 252,
      "x↓": 253,
      "y→": 254,
      "y↑": 255,
      "y↓↑": 256,
      "y↓": 257,
      "z→": 258,
      "z↑": 258,
      "z↓↑": 260,
      "z↓": 261,
      "~→": 262,
      "~↑": 263,
      "~↓↑": 264,
      "~↓": 265,
      "æ→": 266,
      "æ↑": 267,
      "æ↓↑": 268,
      "æ↓": 269,
      "ç→": 270,
      "ç↑": 271,
      "ç↓↑": 272,
      "ç↓": 273,
      "ð→": 274,
      "ð↑": 275,
      "ð↓↑": 276,
      "ð↓": 277,
      "ŋ→": 278,
      "ŋ↑": 279,
      "ŋ↓↑": 280,
      "ŋ↓": 281,
      "ɑ→": 282,
      "ɑ↑": 283,
      "ɑ↓↑": 284,
      "ɑ↓": 285,
      "ɔ→": 286,
      "ɔ↑": 287,
      "ɔ↓↑": 288,
      "ɔ↓": 289,
      "ə→": 290,
      "ə↑": 291,
      "ə↓↑": 292,
      "ə↓": 293,
      "ɛ→": 294,
      "ɛ↑": 295,
      "ɛ↓↑": 296,
      "ɛ↓": 297,
      "ɥ→": 298,
      "ɥ↑": 299,
      "ɥ↓↑": 300,
      "ɥ↓": 301,
      "ɪ→": 302,
      "ɪ↑": 303,
      "ɪ↓↑": 304,
      "ɪ↓": 305,
      "ɫ→": 306,
      "ɫ↑": 307,
      "ɫ↓↑": 308,
      "ɫ↓": 309,
      "ɯ→": 310,
      "ɯ↑": 311,
      "ɯ↓↑": 312,
      "ɯ↓": 313,
      "ɸ→": 314,
      "ɸ↑": 315,
      "ɸ↓↑": 316,
      "ɸ↓": 317,
      "ɹ→": 318,
      "ɹ↑": 319,
      "ɹ↓↑": 320,
      "ɹ↓": 321,
      "ɾ→": 322,
      "ɾ↑": 323,
      "ɾ↓↑": 324,
      "ɾ↓": 325,
      "ʃ→": 326,
      "ʃ↑": 327,
      "ʃ↓↑": 328,
      "ʃ↓": 329,
      "ʊ→": 330,
      "ʊ↑": 331,
      "ʊ↓↑": 332,
      "ʊ↓": 333,
      "ʑ→": 334,
      "ʑ↑": 335,
      "ʑ↓↑": 336,
      "ʑ↓": 337,
      "ʒ→": 338,
      "ʒ↑": 339,
      "ʒ↓↑": 340,
      "ʒ↓": 341,
      "ʰ→": 342,
      "ʰ↑": 343,
      "ʰ↓↑": 344,
      "ʰ↓": 345,
      "ˈ→": 346,
      "ˈ↑": 347,
      "ˈ↓↑": 348,
      "ˈ↓": 349,
      "ˌ→": 350,
      "ˌ↑": 351,
      "ˌ↓↑": 352,
      "ˌ↓": 353,
      "θ→": 354,
      "θ↑": 355,
      "θ↓↑": 356,
      "θ↓": 357,
      "…→": 358,
      "…↑": 359,
      "…↓↑": 360,
      "…↓": 361,
      "⁼→": 352,
      "⁼↑": 363,
      "⁼↓↑": 364,
      "⁼↓": 365,

      "wo→": 366,
      "wo↑": 367,
      "wo↓↑": 368,
      "wo↓": 369,

      "p⁼→": 370,
      "p⁼↑": 370,
      "p⁼↓↑": 372,
      "p⁼↓": 373,

      "pʰ→": 374,
      "pʰ↑": 375,
      "pʰ↓↑": 376,
      "pʰ↓": 377,

      "p⁼wo→": 378,
      "p⁼wo↑": 379,
      "p⁼wo↓↑": 380,
      "p⁼wo↓": 381,

      "pʰwo→": 382,
      "pʰwo↑": 383,
      "pʰwo↓↑": 384,
      "pʰwo↓": 385,

      "mwo→": 386,
      "mwo↑": 387,
      "mwo↓↑": 388,
      "mwo↓": 389,

      "fwo→": 390,
      "fwo↑": 391,
      "fwo↓↑": 392,
      "fwo↓": 393,

      "t⁼→": 394,
      "t⁼↑": 395,
      "t⁼↓↑": 396,
      "t⁼↓": 397,

      "tʰ→": 398,
      "tʰ↑": 399,
      "tʰ↓↑": 400,
      "tʰ↓": 401,

      "k⁼→": 402,
      "k⁼↑": 403,
      "k⁼↓↑": 404,
      "k⁼↓": 405,

      "kʰ→": 406,
      "kʰ↑": 407,
      "kʰ↓↑": 408,
      "kʰ↓": 409,

      "tʃ→": 410,
      "tʃ↑": 411,
      "tʃ↓↑": 412,
      "tʃ↓": 413,

      "tʃ⁼→": 414,
      "tʃ⁼↑": 415,
      "tʃ⁼↓↑": 416,
      "tʃ⁼↓": 417,

      "tʃʰ→": 418,
      "tʃʰ↑": 419,
      "tʃʰ↓↑": 420,
      "tʃʰ↓": 421,
      
      "ts→": 422,
      "ts↑": 423,
      "ts↓↑": 424,
      "ts↓": 425,

      "ts⁼→": 426,
      "ts⁼↑": 427,
      "ts⁼↓↑": 428,
      "ts⁼↓": 429,

      "ts`→": 430,
      "ts`↑": 431,
      "ts`↓↑": 432,
      "ts`↓": 433,

      "tsʰ→": 434,
      "tsʰ↑": 435,
      "tsʰ↓↑": 436,
      "tsʰ↓": 437,

      "ts`⁼→": 438,
      "ts`⁼↑": 439,
      "ts`⁼↓↑": 440,
      "ts`⁼↓": 441,

      "ts`ʰ→": 442,
      "ts`ʰ↑": 443,
      "ts`ʰ↓↑": 444,
      "ts`ʰ↓": 445,

      "s`→": 446,
      "s`↑": 447,
      "s`↓↑": 448,
      "s`↓": 449,

      "ɹ`→": 450,
      "ɹ`↑": 451,
      "ɹ`↓↑": 452,
      "ɹ`↓": 453,

      "s`ɹ`→": 454,
      "s`ɹ`↑": 455,
      "s`ɹ`↓↑": 456,
      "s`ɹ`↓": 457,

      "ɹ`ɹ`→": 458,
      "ɹ`ɹ`↑": 459,
      "ɹ`ɹ`↓↑": 460,
      "ɹ`ɹ`↓": 461,

      "ts`⁼ɹ`→": 462,
      "ts`⁼ɹ`↑": 463,
      "ts`⁼ɹ`↓↑": 464,
      "ts`⁼ɹ`↓": 465,

      "ts`ʰɹ`→": 466,
      "ts`ʰɹ`↑": 467,
      "ts`ʰɹ`↓↑": 468,
      "ts`ʰɹ`↓": 469,

      "ts⁼ɹ→": 470,
      "ts⁼ɹ↑": 471,
      "ts⁼ɹ↓↑": 472,
      "ts⁼ɹ↓": 473,

      "tsʰɹ→": 474,
      "tsʰɹ↑": 475,
      "tsʰɹ↓↑": 476,
      "tsʰɹ↓": 477,

      "sɹ→": 478,
      "sɹ↑": 479,
      "sɹ↓↑": 480,
      "sɹ↓": 481,

      "aɪ→": 482,
      "aɪ↑": 483,
      "aɪ↓↑": 484,
      "aɪ↓": 485,

      "eɪ→": 486,
      "eɪ↑": 487,
      "eɪ↓↑": 488,
      "eɪ↓": 489,

      "ɑʊ→": 490,
      "ɑʊ↑": 491,
      "ɑʊ↓↑": 492,
      "ɑʊ↓": 493,

      "oʊ→": 494,
      "oʊ↑": 495,
      "oʊ↓↑": 496,
      "oʊ↓": 497,

      "jɛ→": 498,
      "jɛ↑": 499,
      "jɛ↓↑": 500,
      "jɛ↓": 501,

      "jɛn→": 502,
      "jɛn↑": 503,
      "jɛn↓↑": 504,
      "jɛn↓": 505,

      "ɥæ→": 506,
      "ɥæ↑": 507,
      "ɥæ↓↑": 508,
      "ɥæ↓": 509,

      "ɥæn→": 510,
      "ɥæn↑": 511,
      "ɥæn↓↑": 512,
      "ɥæn↓": 513,

      "an→": 514,
      "an↑": 515,
      "an↓↑": 516,
      "an↓": 517,

      "in→": 518,
      "in↑": 519,
      "in↓↑": 520,
      "in↓": 521,

      "ɥn→": 522,
      "ɥn↑": 523,
      "ɥn↓↑": 524,
      "ɥn↓": 525,

      "ən→": 526,
      "ən↑": 527,
      "ən↓↑": 528,
      "ən↓": 529,

      "ɑŋ→": 530,
      "ɑŋ↑": 531,
      "ɑŋ↓↑": 532,
      "ɑŋ↓": 533,

      "iŋ→": 534,
      "iŋ↑": 535,
      "iŋ↓↑": 536,
      "iŋ↓": 537,

      "ʊŋ→": 538,
      "ʊŋ↑": 539,
      "ʊŋ↓↑": 540,
      "ʊŋ↓": 541,

      "jʊŋ→": 542,
      "jʊŋ↑": 543,
      "jʊŋ↓↑": 544,
      "jʊŋ↓": 545,

      "əŋ→": 546,
      "əŋ↑": 547,
      "əŋ↓↑": 548,
      "əŋ↓": 549,

      "əɹ`→": 550,
      "əɹ`↑": 551,
      "əɹ`↓↑": 552,
      "əɹ`↓": 553
    },
    "merges": [
      "↓ ↑",
      "w o",
      "p ⁼",
      "p ʰ",
      "p⁼ wo",
      "pʰ wo",
      "m wo",
      "f wo",

      "t ⁼",
      "t ʰ",
      "k ⁼",
      "k ʰ",

      "t ʃ",
      "tʃ ⁼",
      "tʃ ʰ",
      
      "t s",
      "ts ⁼",
      "ts `",
      "ts ʰ",

      "ts` ⁼",
      "ts` ʰ",

      "s `",
      "ɹ `",
      "s` ɹ`",
      "ɹ` ɹ`",
      "ts`⁼ ɹ`",
      "ts`ʰ ɹ`",

      "ts⁼ ɹ",
      "tsʰ ɹ",
      "s ɹ",

      "a ɪ",
      "e ɪ",
      "ɑ ʊ",
      "o ʊ",

      "j ɛ",
      "jɛ n",
      "ɥ æ",
      "ɥæ n",

      "a n",
      "i n",
      "ɥ n",
      "ə n",
      "ɑ ŋ",
      "i ŋ",
      "ʊ ŋ",
      "j ʊŋ",
      "ə ŋ",
      "ə ɹ`",

      "! →",
      "! ↑",
      "! ↓↑",
      "! ↓",
      "# →",
      "# ↑",
      "# ↓↑",
      "# ↓",
      "* →",
      "* ↑",
      "* ↓↑",
      "* ↓",
      ", →",
      ", ↑",
      ", ↓↑",
      ", ↓",
      "- →",
      "- ↑",
      "- ↓↑",
      "- ↓",
      ". →",
      ". ↑",
      ". ↓↑",
      ". ↓",
      "= →",
      "= ↑",
      "= ↓↑",
      "= ↓",
      "? →",
      "? ↑",
      "? ↓↑",
      "? ↓",
      "N →",
      "N ↑",
      "N ↓↑",
      "N ↓",
      "Q →",
      "Q ↑",
      "Q ↓↑",
      "Q ↓",
      "^ →",
      "^ ↑",
      "^ ↓↑",
      "^ ↓",
      "_ →",
      "_ ↑",
      "_ ↓↑",
      "_ ↓",
      "a →",
      "a ↑",
      "a ↓↑",
      "a ↓",
      "b →",
      "b ↑",
      "b ↓↑",
      "b ↓",
      "d →",
      "d ↑",
      "d ↓↑",
      "d ↓",
      "e →",
      "e ↑",
      "e ↓↑",
      "e ↓",
      "f →",
      "f ↑",
      "f ↓↑",
      "f ↓",
      "g →",
      "g ↑",
      "g ↓↑",
      "g ↓",
      "h →",
      "h ↑",
      "h ↓↑",
      "h ↓",
      "i →",
      "i ↑",
      "i ↓↑",
      "i ↓",
      "j →",
      "j ↑",
      "j ↓↑",
      "j ↓",
      "k →",
      "k ↑",
      "k ↓↑",
      "k ↓",
      "l →",
      "l ↑",
      "l ↓↑",
      "l ↓",
      "m →",
      "m ↑",
      "m ↓↑",
      "m ↓",
      "n →",
      "n ↑",
      "n ↓↑",
      "n ↓",
      "o →",
      "o ↑",
      "o ↓↑",
      "o ↓",
      "p →",
      "p ↑",
      "p ↓↑",
      "p ↓",
      "s →",
      "s ↑",
      "s ↓↑",
      "s ↓",
      "t →",
      "t ↑",
      "t ↓↑",
      "t ↓",
      "u →",
      "u ↑",
      "u ↓↑",
      "u ↓",
      "v →",
      "v ↑",
      "v ↓↑",
      "v ↓",
      "w →",
      "w ↑",
      "w ↓↑",
      "w ↓",
      "x →",
      "x ↑",
      "x ↓↑",
      "x ↓",
      "y →",
      "y ↑",
      "y ↓↑",
      "y ↓",
      "z →",
      "z ↑",
      "z ↓↑",
      "z ↓",
      "~ →",
      "~ ↑",
      "~ ↓↑",
      "~ ↓",
      "æ →",
      "æ ↑",
      "æ ↓↑",
      "æ ↓",
      "ç →",
      "ç ↑",
      "ç ↓↑",
      "ç ↓",
      "ð →",
      "ð ↑",
      "ð ↓↑",
      "ð ↓",
      "ŋ →",
      "ŋ ↑",
      "ŋ ↓↑",
      "ŋ ↓",
      "ɑ →",
      "ɑ ↑",
      "ɑ ↓↑",
      "ɑ ↓",
      "ɔ →",
      "ɔ ↑",
      "ɔ ↓↑",
      "ɔ ↓",
      "ə →",
      "ə ↑",
      "ə ↓↑",
      "ə ↓",
      "ɛ →",
      "ɛ ↑",
      "ɛ ↓↑",
      "ɛ ↓",
      "ɥ →",
      "ɥ ↑",
      "ɥ ↓↑",
      "ɥ ↓",
      "ɪ →",
      "ɪ ↑",
      "ɪ ↓↑",
      "ɪ ↓",
      "ɫ →",
      "ɫ ↑",
      "ɫ ↓↑",
      "ɫ ↓",
      "ɯ →",
      "ɯ ↑",
      "ɯ ↓↑",
      "ɯ ↓",
      "ɸ →",
      "ɸ ↑",
      "ɸ ↓↑",
      "ɸ ↓",
      "ɹ →",
      "ɹ ↑",
      "ɹ ↓↑",
      "ɹ ↓",
      "ɾ →",
      "ɾ ↑",
      "ɾ ↓↑",
      "ɾ ↓",
      "ʃ →",
      "ʃ ↑",
      "ʃ ↓↑",
      "ʃ ↓",
      "ʊ →",
      "ʊ ↑",
      "ʊ ↓↑",
      "ʊ ↓",
      "ʑ →",
      "ʑ ↑",
      "ʑ ↓↑",
      "ʑ ↓",
      "ʒ →",
      "ʒ ↑",
      "ʒ ↓↑",
      "ʒ ↓",
      "ʰ →",
      "ʰ ↑",
      "ʰ ↓↑",
      "ʰ ↓",
      "ˈ →",
      "ˈ ↑",
      "ˈ ↓↑",
      "ˈ ↓",
      "ˌ →",
      "ˌ ↑",
      "ˌ ↓↑",
      "ˌ ↓",
      "θ →",
      "θ ↑",
      "θ ↓↑",
      "θ ↓",
      "… →",
      "… ↑",
      "… ↓↑",
      "… ↓",
      "⁼ →",
      "⁼ ↑",
      "⁼ ↓↑",
      "⁼ ↓",
      "wo →",
      "wo ↑",
      "wo ↓↑",
      "wo ↓",

      "p⁼ →",
      "p⁼ ↑",
      "p⁼ ↓↑",
      "p⁼ ↓",

      "pʰ →",
      "pʰ ↑",
      "pʰ ↓↑",
      "pʰ ↓",

      "p⁼wo →",
      "p⁼wo ↑",
      "p⁼wo ↓↑",
      "p⁼wo ↓",

      "pʰwo →",
      "pʰwo ↑",
      "pʰwo ↓↑",
      "pʰwo ↓",

      "mwo →",
      "mwo ↑",
      "mwo ↓↑",
      "mwo ↓",

      "fwo →",
      "fwo ↑",
      "fwo ↓↑",
      "fwo ↓",

      "t⁼ →",
      "t⁼ ↑",
      "t⁼ ↓↑",
      "t⁼ ↓",

      "tʰ →",
      "tʰ ↑",
      "tʰ ↓↑",
      "tʰ ↓",

      "k⁼ →",
      "k⁼ ↑",
      "k⁼ ↓↑",
      "k⁼ ↓",

      "kʰ →",
      "kʰ ↑",
      "kʰ ↓↑",
      "kʰ ↓",

      "tʃ →",
      "tʃ ↑",
      "tʃ ↓↑",
      "tʃ ↓",

      "tʃ⁼ →",
      "tʃ⁼ ↑",
      "tʃ⁼ ↓↑",
      "tʃ⁼ ↓",

      "tʃʰ →",
      "tʃʰ ↑",
      "tʃʰ ↓↑",
      "tʃʰ ↓",
      
      "ts →",
      "ts ↑",
      "ts ↓↑",
      "ts ↓",

      "ts⁼ →",
      "ts⁼ ↑",
      "ts⁼ ↓↑",
      "ts⁼ ↓",

      "ts` →",
      "ts` ↑",
      "ts` ↓↑",
      "ts` ↓",

      "tsʰ →",
      "tsʰ ↑",
      "tsʰ ↓↑",
      "tsʰ ↓",

      "ts`⁼ →",
      "ts`⁼ ↑",
      "ts`⁼ ↓↑",
      "ts`⁼ ↓",

      "ts`ʰ →",
      "ts`ʰ ↑",
      "ts`ʰ ↓↑",
      "ts`ʰ ↓",

      "s` →",
      "s` ↑",
      "s` ↓↑",
      "s` ↓",

      "ɹ` →",
      "ɹ` ↑",
      "ɹ` ↓↑",
      "ɹ` ↓",

      "s`ɹ` →",
      "s`ɹ` ↑",
      "s`ɹ` ↓↑",
      "s`ɹ` ↓",

      "ɹ`ɹ` →",
      "ɹ`ɹ` ↑",
      "ɹ`ɹ` ↓↑",
      "ɹ`ɹ` ↓",

      "ts`⁼ɹ` →",
      "ts`⁼ɹ` ↑",
      "ts`⁼ɹ` ↓↑",
      "ts`⁼ɹ` ↓",

      "ts`ʰɹ` →",
      "ts`ʰɹ` ↑",
      "ts`ʰɹ` ↓↑",
      "ts`ʰɹ` ↓",

      "ts⁼ɹ →",
      "ts⁼ɹ ↑",
      "ts⁼ɹ ↓↑",
      "ts⁼ɹ ↓",

      "tsʰɹ →",
      "tsʰɹ ↑",
      "tsʰɹ ↓↑",
      "tsʰɹ ↓",

      "sɹ →",
      "sɹ ↑",
      "sɹ ↓↑",
      "sɹ ↓",

      "aɪ →",
      "aɪ ↑",
      "aɪ ↓↑",
      "aɪ ↓",

      "eɪ →",
      "eɪ ↑",
      "eɪ ↓↑",
      "eɪ ↓",

      "ɑʊ →",
      "ɑʊ ↑",
      "ɑʊ ↓↑",
      "ɑʊ ↓",

      "oʊ →",
      "oʊ ↑",
      "oʊ ↓↑",
      "oʊ ↓",

      "jɛ →",
      "jɛ ↑",
      "jɛ ↓↑",
      "jɛ ↓",

      "jɛn →",
      "jɛn ↑",
      "jɛn ↓↑",
      "jɛn ↓",

      "ɥæ →",
      "ɥæ ↑",
      "ɥæ ↓↑",
      "ɥæ ↓",

      "ɥæn →",
      "ɥæn ↑",
      "ɥæn ↓↑",
      "ɥæn ↓",

      "an →",
      "an ↑",
      "an ↓↑",
      "an ↓",

      "in →",
      "in ↑",
      "in ↓↑",
      "in ↓",

      "ɥn →",
      "ɥn ↑",
      "ɥn ↓↑",
      "ɥn ↓",

      "ən →",
      "ən ↑",
      "ən ↓↑",
      "ən ↓",

      "ɑŋ →",
      "ɑŋ ↑",
      "ɑŋ ↓↑",
      "ɑŋ ↓",

      "iŋ →",
      "iŋ ↑",
      "iŋ ↓↑",
      "iŋ ↓",

      "ʊŋ →",
      "ʊŋ ↑",
      "ʊŋ ↓↑",
      "ʊŋ ↓",

      "jʊŋ →",
      "jʊŋ ↑",
      "jʊŋ ↓↑",
      "jʊŋ ↓",

      "əŋ →",
      "əŋ ↑",
      "əŋ ↓↑",
      "əŋ ↓",

      "əɹ` →",
      "əɹ` ↑",
      "əɹ` ↓↑",
      "əɹ` ↓"
    ]
  }
}